app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "phone_number", "email", "username", "password", "password_confirmation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)
      @user.save